Revit 2024 API
SpecTypeId.ConduitSize Property
 Conduit Size, in discipline Electrical.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public static ForgeTypeId ConduitSize { get; }
Visual Basic
Public Shared ReadOnly Property ConduitSize As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ ConduitSize {
	ForgeTypeId^ get ();
}
See Also
SpecTypeId Class
Autodesk.Revit.DB Namespace